16-dunder-mifflin-review/app/controllers/dogs_controller.rb

SELECT "dogs".* FROM "dogs"
SELECT "employees".* FROM "employees" WHERE "employees"."dog_id" = ?  [["dog_id", 8]]
---
  def up_for_adoption
    @dogs = Dog.all.select { |d| d.employees.length == 0 }

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "employees".* FROM "employees"
---
  def adopt
    @dog = Dog.find(params[:id])
    @employees = Employee.all

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "employees" SET "updated_at" = ?, "dog_id" = ? WHERE "employees"."id" = ?  [["updated_at", "2019-07-02 15:46:13.833786"], ["dog_id", 13], ["id", 8]]
---
  def finalise_adoption
    byebug
    @employee = Employee.find(params[:dog][:id])
    @employee.update(dog: Dog.find(params[:id]))