17-sessions-cookies/app/controllers/answers_controller.rb

    def new
        @user = session[:user_name] ? User.find_by(name: session[:user_name]) : User.new
        @instructor = Instructor.all.sample
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "sam"], ["LIMIT", 1]]
SELECT "instructors".* FROM "instructors"

    def create
        question = Question.create({instructor_id: params[:answer][:instructor_id]})
        answer = Answer.create(answer_params)
        answer.question = question
        if answer.valid? && answer.user.valid?
            session[:user_name] = answer.user.name
            session[:score] += answer.correct ? 1 : 0
            answer.save
---
INSERT INTO "answers" ("question_id", "cookie_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["question_id", 22], ["cookie_id", 1], ["created_at", "2019-05-27 13:37:09.937945"], ["updated_at", "2019-05-27 13:37:09.937945"], ["user_id", 1]]
INSERT INTO "questions" ("instructor_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["instructor_id", 14], ["created_at", "2019-05-27 13:36:49.966465"], ["updated_at", "2019-05-27 13:36:49.966465"]]
INSERT INTO "answers" ("question_id", "cookie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["question_id", 1], ["cookie_id", 10], ["created_at", "2019-05-27 13:02:27.194498"], ["updated_at", "2019-05-27 13:02:27.194498"]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "sam"], ["created_at", "2019-05-27 13:37:09.927598"], ["updated_at", "2019-05-27 13:37:09.927598"]]
INSERT INTO "answers" ("question_id", "cookie_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["question_id", 17], ["cookie_id", 23], ["created_at", "2019-07-04 15:41:13.246331"], ["updated_at", "2019-07-04 15:41:13.246331"], ["user_id", 1]]